<a id='section_id0'></a>
# BMIS-2542: Data Programming Essentials *with Python*
##### Katz Graduate School of Business, University of Pittsburgh


## Session 3 Exercises

<font color="#740202">**List of Session-3 Exercises:**</font>

(1) [Combining data](#section_id-ex1), (2) [Date stuff](#section_id-ex2), (3) [Missing values](#section_id-ex3), (4) [Categorization](#section_id-ex4), (5) [Ranking](#section_id-ex5), and (6) [Pivot/Crosstabs](#section_id-ex6)
***

In [ ]:
# load required modules
import pandas as pd
import numpy as np
import datetime

***
<a id='section_id-ex1'></a>
### <span style="background-color:#CCFFCC">Class Exercise-1: Combining DataFrames</span>
* Insert a new markdown cell in the notebook and type in the header "Answer Exercise-1".
* Use the dataframes in the example below. Combine the dataframes in a way to display the answers to the following questions:
    * How many shares of S1 does Anne hold?
    * How many shares of Yahoo does John hold?
> Hint: Use pd.merge() and merge the threee dataframes
***
<div style="text-align: right"> <a href='#section_id0'>Back to top of Notebook</a></div>

In [ ]:
dfInvestors = pd.DataFrame({'INo':['I1', 'I2', 'I3'],'IName':['Anne', 'John', 'Elizabeth'],'PhoneNo':['412-456-4567', '585-673-4572', '763-567-8953']})
dfSecurities =  pd.DataFrame({'SNo':['S1', 'S2', 'S3', 'S4', 'S5', 'S6'], 'SName':['Microsoft', 'Kodak', 'IBM','Xerox', 'Amazon', 'Yahoo'], 'Price':[78, 45, 68, 123, 34,78]})
dfHoldings = pd.DataFrame({'INo':['I1','I1','I1','I1','I2','I2','I3','I3','I3'],'SNo':['S1','S2','S3','S4','S2','S6','S1','S3','S4'],'Qty':[500, 2000, 90,200,917,324,1000,346,780]})

***
<a id='section_id-ex2'></a>
### <span style="background-color:#CCFFCC">Class Exercise-2: Date stuff</span>
* Insert a new markdown cell in the notebook and type in the header "Answer Exercise-2".
* Use the Movie Lens dataset (ml1mdata2000.csv) for answering this question: How many movies were rated in the fourth quarter of 2000?

> Hint 1: Use pd.to_datetime() to obtain date from the timestamp.

> Hint 2: Use pd.DatetimeIndex() to obtain the year and month from the date.

> Hint 3: Count the number of data points with 'year'==2000 and 'month'>9.

> Caution: Make sure you don't double (or multiple) count some movies.
***
<div style="text-align: right"> <a href='#section_id0'>Back to top of Notebook</a></div>

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
mlmdata = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Python Course/Large Data Sets/ml1mdata2000.csv')
mlmdata.head()

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1.0,1193.0,5,978300760,F,1.0,10.0,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2.0,1193.0,5,978298413,M,56.0,16.0,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12.0,1193.0,4,978220179,M,25.0,12.0,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15.0,1193.0,4,978199279,M,25.0,7.0,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17.0,1193.0,5,978158471,M,50.0,1.0,95350,One Flew Over the Cuckoo's Nest (1975),Drama

***
<a id='section_id-ex3'></a>
### <span style="background-color:#CCFFCC">Class Exercise-3: Compiling missing values</span>
* Insert a new markdown cell in the notebook and type in the header "Answer Exercise-3".
* Use the Movie Lens dataset (ml1mdata2000.csv) for this exercise.
* Create a dataframe that compiles the count of missing values in the Movie Lens dataset. That is, for each movie (movie_id) obtain "total count of records with missing values" and "proportion of missing values".

> Hint 1: Use data.isna().any(axis=1) and create a new variable named "missing" for each row that will contain 1 if that row has a missing values, otherwise 0.

> Hint 2: Use data.groupby() on movie_id to calculate total missing values for each movie_id. Similarly, calculate the number of data points for each movie_id.
***
<div style="text-align: right"> <a href='#section_id0'>Back to top of Notebook</a></div>

***
<a id='section_id-ex4'></a>
### <span style="background-color:#CCFFCC">Class Exercise-4: Categorization</span>
* Insert a new markdown cell in the notebook and type in the header "Exercise-4".
* Use the Movie Lens dataset for this exercise
* Insert a new column called "rating_category" into the dataframe. It is coded as following depending on the value of "movie rating": 1 & 2: Okay; 3 & 4: Good; 5: Excellent

> Hint: Use pd.cut().
***
<div style="text-align: right"> <a href='#section_id0'>Back to top of Notebook</a></div>

***
<a id='section_id-ex5'></a>
### <span style="background-color:#CCFFCC">Class Exercise-5: Grouping and ranking</span>
* Insert a new markdown cell in the notebook and type in the header "Exercise-5".
* Create a dataframe with the information below based on the Movie Lens dataset

| Movie ID| Average rating |Absolute rank| Percentile rank|
|-------|--------|--------------|-------------------|
|||||

> Hint 1: Use groupby('movie_id') to obtain average rating of movies.

> Hint 2: Then use rank(ascending=False) and rank(pct=True) to obtain rank and percentile rank.


***
<div style="text-align: right"> <a href='#section_id0'>Back to top of Notebook</a></div>

***
<a id='section_id-ex6'></a>
### <span style="background-color:#CCFFCC">Class Exercise-6: Pivot/crosstabs</span>
* Insert a new markdown cell in the notebook and type in the header "Exercise-6".
* Use the Movie Lens dataset, and show a table with the average ratings of movies in Zip codes that contain the term "007".

> Hint: Obtain a pivot table using pd.pivot_table(). Then, use str.contains('007').
***

***
<a id='section_id-ex6'></a>
### <span style="background-color:#CCFFCC">Class Exercise-7: Merging Datasets</span>
* Use "worlddata.csv" from the "Large Data Set" folder and create a dataset that has the following variables: Death_Rate, Rural_Population, International_Migrants.

> Hint: The corresponding values of IndicatorName are as follows:
* **Death_Rate:** "Death rate, crude (per 1,000 people)"
* **Rural_Population:** "Rural population"
* **International_Migrants:** "International migrant stock, total"

***

### Class Exercise-8: Repeat what is asked in Q7 using Pivot Table (instead of merging).
> Hint: Refer to last section in file "Session3_Merging_Datasets.ipynb".